In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

1. How big is the data?

In [4]:
df.shape

(891, 12)

2. How does the data look like?

df.head()
Purpose: Displays the first few rows (by default, the first 5 rows) of a DataFrame.
Output: Returns a new DataFrame containing the specified number of rows from the beginning of the original DataFrame.
Behavior: Always returns the same rows (first few rows) every time it's called on the same DataFrame.

df.sample()
Purpose: Selects a random sample of rows from a DataFrame.
Output: Returns a new DataFrame containing the specified number of rows randomly selected from the original DataFrame.
Behavior: Returns different rows each time it's called, as the selection is random.

In [5]:
df.sample(5)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
832,833,"Saad, Mr. Amin",3,male,NaN,0,0,2671,7.2292,NaN,C,0
712,713,"Taylor, Mr. Elmer Zebley",1,male,48.0,1,0,19996,52.0000,C126,S,1
694,695,"Weir, Col. John",1,male,60.0,0,0,113800,26.5500,NaN,S,0
279,280,"Abbott, Mrs. Stanton (Rosa Hunt)",3,female,35.0,1,1,C.A. 2673,20.2500,NaN,S,1
579,580,"Jussila, Mr. Eiriik",3,male,32.0,0,0,STON/O 2. 3101286,7.9250,NaN,S,1

3. What is the data type of cols?

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Name         891 non-null    object
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Survived     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

4. Are there any missing values?

In [7]:
df.isnull().sum()

PassengerId      0
Name             0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

5. How does the data look mathematically?

In [8]:
df.describe()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Survived
count,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,2.308642,29.699118,0.523008,0.381594,32.204208,0.383838
std,257.353842,0.836071,14.526497,1.102743,0.806057,49.693429,0.486592
min,1.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,446.000000,3.000000,28.000000,0.000000,0.000000,14.454200,0.000000
75%,668.500000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,891.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

6. Are there duplicate values?

In [10]:
df.duplicated().sum()

0

7. How is the correlation between cols?

In [13]:
numerical_df = df.select_dtypes(include=[np.number])
numerical_df.corr()['Survived']

PassengerId   -0.005007
Pclass        -0.338481
Age           -0.077221
SibSp         -0.035322
Parch          0.081629
Fare           0.257307
Survived       1.000000
Name: Survived, dtype: float64